
// Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const button1 = prompt('1');
const button2 = prompt('2');

if (button1 && button2) {
  alert('Обидва поля заповнені');
} else {
  alert('Не всі поля заповнені');
}

// 1 ^
// 2 v

// Створити розмітку  з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const amount1 = Number(prompt('Введіть ващі кошти'));
const amount2 = Number(prompt('Введіть ващі кошти'));

const add = amount2 + amount1;

if (add > 10) {
  alert('Сума більша за 10');
} else {
  alert('Сума менша або дорівнює 10');
}

// 2 ^
// 3 v

// Створити розмітку  з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

// str.include("str")

let text = prompt('Введіть текст JavaScript');

if (text.includes("JavaScript")) {
  alert('Текст містить слово JavaScript');
} else {
  alert('Tекст не містить слово JavaScript');
}

// 3 ^
// 4 v
// творити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".

const form = Number(prompt('Введіть число від 10 - 20'));

if (form > 9 && form < 21) {
  alert('Число входить в діапазон від 10 до 20')
} else {
  alert('Число не входить в діапазон від 10 до 20')
}

// 4 ^
// 5 v
// Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.

const email = prompt("Введіть вашу електрону почту.")
const passWord = prompt("Введіть ваш пароль довжен містить 6 символів.")
const names = prompt("Введіть ваше ім'я має містити 3 символів.")

if (email.includes("@") && email.includes(".") && passWord.length > 6 && names.length > 3) {
  
} else {
  alert('Ви вели неправильний пароль, електрону почту чи імʼя.')
}

// 5 ^
